In [1]:
import pandas as pd
data = pd.read_csv('titanic.csv')
data.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
data.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = data.Survived
inputs = data.drop('Survived',axis='columns')

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs['Age'] = inputs['Age'].fillna(inputs['Age'].mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [16]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size=0.3)

In [17]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [18]:
model.fit(x_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [19]:
model.score(x_test,y_test)

0.7985074626865671

In [20]:
x_test[:10]

     Pclass        Age     Fare  female  male
514       3  24.000000   7.4958       0     1
132       3  47.000000  14.5000       1     0
743       3  24.000000  16.1000       0     1
34        1  28.000000  82.1708       0     1
578       3  29.699118  14.4583       1     0
2         3  26.000000   7.9250       1     0
237       2   8.000000  26.2500       1     0
66        2  29.000000  10.5000       1     0
220       3  16.000000   8.0500       0     1
819       3  10.000000  27.9000       0     1

In [21]:
y_test.head(10)

514    0
132    0
743    0
34     0
578    0
2      1
237    1
66     1
220    1
819    0
Name: Survived, dtype: int64

In [22]:
model.predict(x_test[:10])

array([0, 1, 0, 0, 1, 1, 1, 1, 0, 0], dtype=int64)

In [23]:
model.predict_proba(x_test[:10])

array([[0.98795682, 0.01204318],
       [0.07901006, 0.92098994],
       [0.98828627, 0.01171373],
       [0.68128129, 0.31871871],
       [0.07362486, 0.92637514],
       [0.06906049, 0.93093951],
       [0.02310219, 0.97689781],
       [0.03491587, 0.96508413],
       [0.98619787, 0.01380213],
       [0.98370124, 0.01629876]])